In [2]:
import numpy as np
import pandas as pd

In [5]:
# remove the warning
import warnings
warnings.filterwarnings('ignore')
# this is supposed to be used at the top of the page to not to see any warnings

In [18]:
import seaborn as sns
# seaborn is data visualization library

In [4]:
sns.get_dataset_names()

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'dowjones',
 'exercise',
 'flights',
 'fmri',
 'geyser',
 'glue',
 'healthexp',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'seaice',
 'taxis',
 'tips',
 'titanic']

In [5]:
titanic = sns.load_dataset('titanic')
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [7]:
titanic_copy = titanic.copy()

In [8]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [11]:
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

In [17]:
titanic.sample(5)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
573,1,3,female,NaN,0,0,7.7500,Q,Third,woman,False,NaN,Queenstown,yes,True
368,1,3,female,NaN,0,0,7.7500,Q,Third,woman,False,NaN,Queenstown,yes,True
466,0,2,male,NaN,0,0,0.0000,S,Second,man,True,NaN,Southampton,no,True
489,1,3,male,9.0,1,1,15.9000,S,Third,child,False,NaN,Southampton,yes,False
547,1,2,male,NaN,0,0,13.8625,C,Second,man,True,NaN,Cherbourg,yes,True

In [18]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [ ]:
titanic.describe()
# gives you statistical information on numerical data

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [ ]:
titanic.describe().T
# replace the columns with tows, rows with column

          count       mean        std   min      25%      50%   75%       max
survived  891.0   0.383838   0.486592  0.00   0.0000   0.0000   1.0    1.0000
pclass    891.0   2.308642   0.836071  1.00   2.0000   3.0000   3.0    3.0000
age       714.0  29.699118  14.526497  0.42  20.1250  28.0000  38.0   80.0000
sibsp     891.0   0.523008   1.102743  0.00   0.0000   0.0000   1.0    8.0000
parch     891.0   0.381594   0.806057  0.00   0.0000   0.0000   0.0    6.0000
fare      891.0  32.204208  49.693429  0.00   7.9104  14.4542  31.0  512.3292

In [ ]:
titanic.describe(include='object')
# will give you information about object data type

         sex embarked  who  embark_town alive
count    891      889  891          889   891
unique     2        3    3            3     2
top     male        S  man  Southampton    no
freq     577      644  537          644   549

In [ ]:
titanic.describe(include='all')
# will give you information about all data type
# rows mean, std, min, 25%, 50%, 75%, and max will give you numerical data
# rows count, unique, top, and freq will give you categorical data

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
count,891.000000,891.000000,891,714.000000,891.000000,891.000000,891.000000,889,891,891,891,203,889,891,891
unique,NaN,NaN,2,NaN,NaN,NaN,NaN,3,3,3,2,7,3,2,2
top,NaN,NaN,male,NaN,NaN,NaN,NaN,S,Third,man,True,C,Southampton,no,True
freq,NaN,NaN,577,NaN,NaN,NaN,NaN,644,491,537,537,59,644,549,537
mean,0.383838,2.308642,NaN,29.699118,0.523008,0.381594,32.204208,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
std,0.486592,0.836071,NaN,14.526497,1.102743,0.806057,49.693429,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
min,0.000000,1.000000,NaN,0.420000,0.000000,0.000000,0.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25%,0.000000,2.000000,NaN,20.125000,0.000000,0.000000,7.910400,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
50%,0.000000,3.000000,NaN,28.000000,0.000000,0.000000,14.454200,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
75%,1.000000,3.000000,NaN,38.000000,1.000000,0.000000,31.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
max,1.000000,3.000000,NaN,80.000000,8.000000,6.000000,512.329200,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [23]:
titanic.head(2)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False

In [24]:
titanic.survived.value_counts()
# give distribution, how the values are distributed

survived
0    549
1    342
Name: count, dtype: int64

In [25]:
titanic.survived.value_counts(normalize=True)
# given the distrubiton in rate or ration

survived
0    0.616162
1    0.383838
Name: proportion, dtype: float64

In [26]:
titanic.head(2)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False

- in titanic dataset, we have 3 columns that give me same data
    - columns sex, who, and adult_male give the data
- this is called "noisy", it is unnecessery to show same data on dataset
- we want to drop the unnecessey column, we can drop the column

In [27]:
titanic.drop('adult_male', axis=1, inplace=True)
# we have columns name first
# then we wrote axis=1 so python knows to drop the column
# to make it perminant, inplace=True

In [29]:
titanic.head(2)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,C,Cherbourg,yes,False

In [31]:
titanic[100:201]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,deck,embark_town,alive,alone
100,0,3,female,28.0,0,0,7.8958,S,Third,woman,NaN,Southampton,no,True
101,0,3,male,NaN,0,0,7.8958,S,Third,man,NaN,Southampton,no,True
102,0,1,male,21.0,0,1,77.2875,S,First,man,D,Southampton,no,False
103,0,3,male,33.0,0,0,8.6542,S,Third,man,NaN,Southampton,no,True
104,0,3,male,37.0,2,0,7.9250,S,Third,man,NaN,Southampton,no,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
196,0,3,male,NaN,0,0,7.7500,Q,Third,man,NaN,Queenstown,no,True
197,0,3,male,42.0,0,1,8.4042,S,Third,man,NaN,Southampton,no,False
198,1,3,female,NaN,0,0,7.7500,Q,Third,woman,NaN,Queenstown,yes,True
199,0,2,female,24.0,0,0,13.0000,S,Second,woman,NaN,Southampton,no,True
200,0,3,male,28.0,0,0,9.5000,S,Third,man,NaN,Southampton,no,True

In [32]:
titanic.loc[100:200]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,deck,embark_town,alive,alone
100,0,3,female,28.0,0,0,7.8958,S,Third,woman,NaN,Southampton,no,True
101,0,3,male,NaN,0,0,7.8958,S,Third,man,NaN,Southampton,no,True
102,0,1,male,21.0,0,1,77.2875,S,First,man,D,Southampton,no,False
103,0,3,male,33.0,0,0,8.6542,S,Third,man,NaN,Southampton,no,True
104,0,3,male,37.0,2,0,7.9250,S,Third,man,NaN,Southampton,no,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
196,0,3,male,NaN,0,0,7.7500,Q,Third,man,NaN,Queenstown,no,True
197,0,3,male,42.0,0,1,8.4042,S,Third,man,NaN,Southampton,no,False
198,1,3,female,NaN,0,0,7.7500,Q,Third,woman,NaN,Queenstown,yes,True
199,0,2,female,24.0,0,0,13.0000,S,Second,woman,NaN,Southampton,no,True
200,0,3,male,28.0,0,0,9.5000,S,Third,man,NaN,Southampton,no,True

In [33]:
titanic.loc[100:200,'age':'fare']

      age  sibsp  parch     fare
100  28.0      0      0   7.8958
101   NaN      0      0   7.8958
102  21.0      0      1  77.2875
103  33.0      0      0   8.6542
104  37.0      2      0   7.9250
..    ...    ...    ...      ...
196   NaN      0      0   7.7500
197  42.0      0      1   8.4042
198   NaN      0      0   7.7500
199  24.0      0      0  13.0000
200  28.0      0      0   9.5000

[101 rows x 4 columns]

In [34]:
titanic.iloc[100:201,3:7]

      age  sibsp  parch     fare
100  28.0      0      0   7.8958
101   NaN      0      0   7.8958
102  21.0      0      1  77.2875
103  33.0      0      0   8.6542
104  37.0      2      0   7.9250
..    ...    ...    ...      ...
196   NaN      0      0   7.7500
197  42.0      0      1   8.4042
198   NaN      0      0   7.7500
199  24.0      0      0  13.0000
200  28.0      0      0   9.5000

[101 rows x 4 columns]

In [ ]:
# selection with condition
titanic[titanic.age > 30]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,C,Cherbourg,yes,False
3,1,1,female,35.0,1,0,53.1000,S,First,woman,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,NaN,Southampton,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,E,Southampton,no,True
11,1,1,female,58.0,0,0,26.5500,S,First,woman,C,Southampton,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
873,0,3,male,47.0,0,0,9.0000,S,Third,man,NaN,Southampton,no,True
879,1,1,female,56.0,0,1,83.1583,C,First,woman,C,Cherbourg,yes,False
881,0,3,male,33.0,0,0,7.8958,S,Third,man,NaN,Southampton,no,True
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,NaN,Queenstown,no,False
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,NaN,Queenstown,no,True

In [39]:
# find data age >0 and survided = 1
titanic[(titanic.age > 30) & (titanic.survived > 0)]
titanic[titanic.age > 30][titanic.survived > 0]

/var/folders/ql/6jtsbr19249bjfqdx_b2n8640000gn/T/ipykernel_63577/1880433315.py:3: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  titanic[titanic.age > 30][titanic.survived > 0]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,C,Cherbourg,yes,False
3,1,1,female,35.0,1,0,53.1000,S,First,woman,C,Southampton,yes,False
11,1,1,female,58.0,0,0,26.5500,S,First,woman,C,Southampton,yes,True
15,1,2,female,55.0,0,0,16.0000,S,Second,woman,NaN,Southampton,yes,True
21,1,2,male,34.0,0,0,13.0000,S,Second,man,D,Southampton,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
857,1,1,male,51.0,0,0,26.5500,S,First,man,E,Southampton,yes,True
862,1,1,female,48.0,0,0,25.9292,S,First,woman,D,Southampton,yes,True
865,1,2,female,42.0,0,0,13.0000,S,Second,woman,NaN,Southampton,yes,True
871,1,1,female,47.0,1,1,52.5542,S,First,woman,D,Southampton,yes,False
879,1,1,female,56.0,0,1,83.1583,C,First,woman,C,Cherbourg,yes,False

In [ ]:
titanic[(titanic.age > 30) & (titanic.survived > 0)].sex.value_counts()

sex
female    83
male      41
Name: count, dtype: int64

In [41]:
old_survivors = titanic[(titanic.age > 30) & (titanic.survived > 0)]
old_survivors

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,C,Cherbourg,yes,False
3,1,1,female,35.0,1,0,53.1000,S,First,woman,C,Southampton,yes,False
11,1,1,female,58.0,0,0,26.5500,S,First,woman,C,Southampton,yes,True
15,1,2,female,55.0,0,0,16.0000,S,Second,woman,NaN,Southampton,yes,True
21,1,2,male,34.0,0,0,13.0000,S,Second,man,D,Southampton,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
857,1,1,male,51.0,0,0,26.5500,S,First,man,E,Southampton,yes,True
862,1,1,female,48.0,0,0,25.9292,S,First,woman,D,Southampton,yes,True
865,1,2,female,42.0,0,0,13.0000,S,Second,woman,NaN,Southampton,yes,True
871,1,1,female,47.0,1,1,52.5542,S,First,woman,D,Southampton,yes,False
879,1,1,female,56.0,0,1,83.1583,C,First,woman,C,Cherbourg,yes,False

In [43]:
old_survivors[old_survivors.sex == 'male']

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,deck,embark_town,alive,alone
21,1,2,male,34.0,0,0,13.0000,S,Second,man,D,Southampton,yes,True
74,1,3,male,32.0,0,0,56.4958,S,Third,man,NaN,Southampton,yes,True
187,1,1,male,45.0,0,0,26.5500,S,First,man,NaN,Southampton,yes,True
209,1,1,male,40.0,0,0,31.0000,C,First,man,A,Cherbourg,yes,True
224,1,1,male,38.0,1,0,90.0000,S,First,man,C,Southampton,yes,False
248,1,1,male,37.0,1,1,52.5542,S,First,man,D,Southampton,yes,False
288,1,2,male,42.0,0,0,13.0000,S,Second,man,NaN,Southampton,yes,True
338,1,3,male,45.0,0,0,8.0500,S,Third,man,NaN,Southampton,yes,True
390,1,1,male,36.0,1,2,120.0000,S,First,man,B,Southampton,yes,False
400,1,3,male,39.0,0,0,7.9250,S,Third,man,NaN,Southampton,yes,True
414,1,3,male,44.0,0,0,7.9250,S,Third,man,NaN,Southampton,yes,True
429,1,3,male,32.0,0,0,8.0500,S,Third,man,E,Southampton,yes,True
447,1,1,male,34.0,0,0,26.5500,S,First,man,NaN,Southampton,yes,True
449,1,1,male,52.0,0,0,30.5000,S,First,man,C,Southampton,yes,True
453,1,1,male,49.0,1,0,89.1042,C,First,man,C,Cherbourg,yes,False
460,1,1,male,48.0,0,0,26.5500,S,First,man,E,Southampton,yes,True
512,1,1,male,36.0,0,0,26.2875,S,First,man,E,Southampton,yes,True
543,1,2,male,32.0,1,0,26.0000,S,Second,man,NaN,Southampton,yes,False
569,1,3,male,32.0,0,0,7.8542,S,Third,man,NaN,Southampton,yes,True
570,1,2,male,62.0,0,0,10.5000,S,Second,man,NaN,Southampton,yes,True
572,1,1,male,36.0,0,0,26.3875,S,First,man,E,Southampton,yes,True
579,1,3,male,32.0,0,0,7.9250,S,Third,man,NaN,Southampton,yes,True
587,1,1,male,60.0,1,1,79.2000,C,First,man,B,Cherbourg,yes,False
599,1,1,male,49.0,1,0,56.9292,C,First,man,A,Cherbourg,yes,False
604,1,1,male,35.0,0,0,26.5500,C,First,man,NaN,Cherbourg,yes,True
621,1,1,male,42.0,1,0,52.5542,S,First,man,D,Southampton,yes,False
630,1,1,male,80.0,0,0,30.0000,S,First,man,A,Southampton,yes,True
632,1,1,male,32.0,0,0,30.5000,C,First,man,B,Cherbourg,yes,True
645,1,1,male,48.0,1,0,76.7292,C,First,man,D,Cherbourg,yes,False
647,1,1,male,56.0,0,0,35.5000,C,First,man,A,Cherbourg,yes,True
660,1,1,male,50.0,2,0,133.6500,S,First,man,NaN,Southampton,yes,False
673,1,2,male,31.0,0,0,13.0000,S,Second,man,NaN,Southampton,yes,True
679,1,1,male,36.0,0,1,512.3292,C,First,man,B,Cherbourg,yes,False
690,1,1,male,31.0,1,0,57.0000,S,First,man,B,Southampton,yes,False
701,1,1,male,35.0,0,0,26.2875,S,First,man,E,Southampton,yes,True
707,1,1,male,42.0,0,0,26.2875,S,First,man,E,Southampton,yes,True
712,1,1,male,48.0,1,0,52.0000,S,First,man,C,Southampton,yes,False
737,1,1,male,35.0,0,0,512.3292,C,First,man,B,Cherbourg,yes,True
744,1,3,male,31.0,0,0,7.9250,S,Third,man,NaN,Southampton,yes,True
838,1,3,male,32.0,0,0,56.4958,S,Third,man,NaN,Southampton,yes,True
857,1,1,male,51.0,0,0,26.5500,S,First,man,E,Southampton,yes,True

In [51]:
# set the embark_town as index
titanic.set_index('embark_town', inplace=True)
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,deck,alive,alone
embark_town,,,,,,,,,,,,,
Southampton,0,3,male,22.0,1,0,7.2500,S,Third,man,NaN,no,False
Cherbourg,1,1,female,38.0,1,0,71.2833,C,First,woman,C,yes,False
Southampton,1,3,female,26.0,0,0,7.9250,S,Third,woman,NaN,yes,True
Southampton,1,1,female,35.0,1,0,53.1000,S,First,woman,C,yes,False
Southampton,0,3,male,35.0,0,0,8.0500,S,Third,man,NaN,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...
Southampton,0,2,male,27.0,0,0,13.0000,S,Second,man,NaN,no,True
Southampton,1,1,female,19.0,0,0,30.0000,S,First,woman,B,yes,True
Southampton,0,3,female,NaN,1,2,23.4500,S,Third,woman,NaN,no,False
Cherbourg,1,1,male,26.0,0,0,30.0000,C,First,man,C,yes,True
Queenstown,0,3,male,32.0,0,0,7.7500,Q,Third,man,NaN,no,True

In [52]:
# reset the index
titanic.reset_index(inplace=True)
titanic

,embark_town,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,deck,alive,alone
0,Southampton,0,3,male,22.0,1,0,7.2500,S,Third,man,NaN,no,False
1,Cherbourg,1,1,female,38.0,1,0,71.2833,C,First,woman,C,yes,False
2,Southampton,1,3,female,26.0,0,0,7.9250,S,Third,woman,NaN,yes,True
3,Southampton,1,1,female,35.0,1,0,53.1000,S,First,woman,C,yes,False
4,Southampton,0,3,male,35.0,0,0,8.0500,S,Third,man,NaN,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,Southampton,0,2,male,27.0,0,0,13.0000,S,Second,man,NaN,no,True
887,Southampton,1,1,female,19.0,0,0,30.0000,S,First,woman,B,yes,True
888,Southampton,0,3,female,NaN,1,2,23.4500,S,Third,woman,NaN,no,False
889,Cherbourg,1,1,male,26.0,0,0,30.0000,C,First,man,C,yes,True
890,Queenstown,0,3,male,32.0,0,0,7.7500,Q,Third,man,NaN,no,True

In [53]:
titanic.set_index('embark_town', inplace=True)
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,deck,alive,alone
embark_town,,,,,,,,,,,,,
Southampton,0,3,male,22.0,1,0,7.2500,S,Third,man,NaN,no,False
Cherbourg,1,1,female,38.0,1,0,71.2833,C,First,woman,C,yes,False
Southampton,1,3,female,26.0,0,0,7.9250,S,Third,woman,NaN,yes,True
Southampton,1,1,female,35.0,1,0,53.1000,S,First,woman,C,yes,False
Southampton,0,3,male,35.0,0,0,8.0500,S,Third,man,NaN,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...
Southampton,0,2,male,27.0,0,0,13.0000,S,Second,man,NaN,no,True
Southampton,1,1,female,19.0,0,0,30.0000,S,First,woman,B,yes,True
Southampton,0,3,female,NaN,1,2,23.4500,S,Third,woman,NaN,no,False
Cherbourg,1,1,male,26.0,0,0,30.0000,C,First,man,C,yes,True
Queenstown,0,3,male,32.0,0,0,7.7500,Q,Third,man,NaN,no,True

In [54]:
# dropdding the embark_town column
titanic.reset_index(drop=True, inplace=True)
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,deck,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,NaN,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,C,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,NaN,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,C,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,NaN,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,NaN,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,B,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,NaN,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,C,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,NaN,no,True

In [55]:
# create a numpy array with 4 rows and 5 columns
# values between 1 and 20, using arange and reshape
np.arange(1, 21).reshape(4, 5)

array([[ 1,  2,  3,  4,  5],
       [ 6,  7,  8,  9, 10],
       [11, 12, 13, 14, 15],
       [16, 17, 18, 19, 20]])

In [56]:
# create a andas data from it
pd.DataFrame(np.arange(1, 21).reshape(4, 5))

    0   1   2   3   4
0   1   2   3   4   5
1   6   7   8   9  10
2  11  12  13  14  15
3  16  17  18  19  20

In [57]:
# assign column names as c1, c2, etc
pd.DataFrame(np.arange(1, 21).reshape(4, 5), columns=['c1', 'c2', 'c3', 'c4', 'c5'])

# another way
pd.DataFrame(np.arange(1, 21).reshape(4, 5), columns='c1 c2 c3 c4 c5'.split())

   c1  c2  c3  c4  c5
0   1   2   3   4   5
1   6   7   8   9  10
2  11  12  13  14  15
3  16  17  18  19  20

In [58]:
# assign row lables or indexes as r1, r2, etc
pd.DataFrame(np.arange(1, 21).reshape(4, 5), columns='c1 c2 c3 c4 c5'.split(), index='r1 r2 r3 r4'.split())

    c1  c2  c3  c4  c5
r1   1   2   3   4   5
r2   6   7   8   9  10
r3  11  12  13  14  15
r4  16  17  18  19  20

In [59]:
# assign it to variable
df = pd.DataFrame(np.arange(1, 21).reshape(4, 5), columns='c1 c2 c3 c4 c5'.split(), index='r1 r2 r3 r4'.split())
df

    c1  c2  c3  c4  c5
r1   1   2   3   4   5
r2   6   7   8   9  10
r3  11  12  13  14  15
r4  16  17  18  19  20

In [60]:
# use sample function to get two random samples of the dataframe
df.sample(2)

    c1  c2  c3  c4  c5
r2   6   7   8   9  10
r1   1   2   3   4   5

In [61]:
df

    c1  c2  c3  c4  c5
r1   1   2   3   4   5
r2   6   7   8   9  10
r3  11  12  13  14  15
r4  16  17  18  19  20

In [62]:
# use loc to ge the following
# 7, 8, 9
# 12, 13, 14
df.loc['r2':'r4','c2':'c4']

    c2  c3  c4
r2   7   8   9
r3  12  13  14
r4  17  18  19

In [63]:
# use iloc to get
# 3, 5
# 8, 10
df.iloc[:2,2::2]

# another way
df.iloc[:2,[2,4]]

    c3  c5
r1   3   5
r2   8  10

In [64]:
# delete r4 and make it permanent
df.drop('r4', inplace=True)
df

    c1  c2  c3  c4  c5
r1   1   2   3   4   5
r2   6   7   8   9  10
r3  11  12  13  14  15

In [65]:
# delete c3 and make it permanent
df.drop('c3', inplace=True, axis=1)
df

    c1  c2  c4  c5
r1   1   2   4   5
r2   6   7   9  10
r3  11  12  14  15